Revit 2027 API
BuiltInFailures.ImportFailures.IFCGenericRevitImportWarning Property
 Revit had the following problems importing the IFC file: [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IFCGenericRevitImportWarning { get; }
Public Shared ReadOnly Property IFCGenericRevitImportWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IFCGenericRevitImportWarning {
	FailureDefinitionId^ get ();
}
static member IFCGenericRevitImportWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace